name: "RecurrentTracker"

## bottom[0]: X is T x N x max_nseg x dim
## bottom[1]: V is T x N x max_ntrack x max_nseg
## bottom[2]: cont is T x N

input: "X"
input: "V"
input: "cont"

input_shape {
  dim: 20
  dim: 1
  dim: 10
  dim: 20
}
input_shape {
  dim: 20
  dim: 1
  dim: 5
  dim: 10
}
input_shape {
  dim: 20
  dim: 1
}

layer {
  name: "recurrent_tracker"
  type: "RecurrentTracker"
  bottom: "X"
  bottom: "V"
  bottom: "cont"
  top: "Y"
  top: "Wcont_0"
  top: "Wcont_1"
  recurrent_tracker_param {
    lambda: 1
    alpha: 1
  }
}
